# Development tools
cask "iterm2"
brew "zsh-autocomplete"
brew "git"
brew "tmux"
brew "tmuxinator"
brew "htop"
brew "tig"
brew "jq"
brew "gh"
cask "jetbrains-toolbox"

# Apps
cask "arc"
cask "fantastical"
cask "slack"
cask "spotify"
cask "1password"
cask "rectangle"
cask "tuple"
cask "zoom"
cask "chatgpt"
mas "Irvue", id: 1039633667

# Data stores
# brew "postgresql", restart_service: :changed
# brew "mysql", restart_service: :changed
# brew "redis", restart_service: :changed

# Node / TypeScript
# brew "node"

# Python
# brew "python"

# Go
# brew "go"
# brew "protobuf"

# Ruby
# brew "ruby"

# Rust
# brew "rustup"

# Infrastructure
# brew "terraform"
# brew "terragrunt"
# cask "docker-desktop"
# brew "awscli"

# Miscellaneous
# tap "oven-sh/bun"
# brew "oven-sh/bun/bun"
# brew "diff-pdf"
# brew "git-lfs"
# cask "ngrok"
# cask "postman"
# cask "discord"
